#Типы данных 1
def primer_2(): # Объявление функции primer_2()
    a=1
    b=5
    f=a+b
    print ('f равно '+str(f)) 
            #str(f) - этим действием
            # переменная f из целого числа 
            # стала строкой. Без этого
            # программа выдала бы ошибку потому
            # что мы складываем текст "f  равно"
            # и значение переменной f

    print (int(-2.3)) 
            # здесь мы переводим дробное число
            # -2.3 в целое (отбрасывается остаток)

    print (float(15)) 
            # а тут наоборот целое число 15
            # преобразуем в дробное (выйдет 15.0) 
  
def main():
    primer_2()
    return 0
 
if __name__ == '__main__':
    main()