#Операции со строками 
text = str(input('Введите свой текст:'))
print('Количество символов в вашем тексте:',len(text))
s = int(input('Какой символ будет начальным? :'))
f = int(input('Какой символ будет конечным? :'))
t = int(input('Какой шаг используем? :'))
print (text[s:f:t])

''' text = str(input(‘Введите свой текст:’)): задать свой текст
print(‘Количество символов в вашем тексте:’,len(text)): получить количество символов в вашем тексте
s = int(input(‘Какой символ будет начальным? :’)): указать начальный символ в диапазоне
f = int(input(‘Какой символ будет конечным? :’)): указать конечный символ в диапазоне
t = int(input(‘Какой шаг используем? :’)): указать желаемый шаг
print (text[s:f:t]): получить на экране символы из вашего текста с указанным шагом'''